v2206/solver_ADMFoam/multi_gasGenComparison/icoReactingMultiphaseInterFoam/constant/thermophysicalProperties.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type                heRhoThermo;
    mixture             pureMixture;
    transport           const;
    thermo              hConst;
    equationOfState     rhoConst;
    specie              specie;
    energy              sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18.9;
    }
    equationOfState
    {
        rho             1000;
    }
    thermodynamics
    {
        Cp              1;
        Hf              0; //[J/Kg]
        
        // Cp              4.186e3;
        // Hf              -2.4e6; //[J/Kg]
    }
    transport
    {
        mu              1e-3;
        Pr              0.7;
    }
}


// ************************************************************************* //
