v2206/solver_ADMFoam/multi_gasGenComparison/icoReactingMultiphaseInterFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(rhoPhi,U)       Gauss upwind;

    div(phi,k)          Gauss upwind;
    div(phi,omega)      Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(phi,T)          Gauss linearUpwind grad(T);
    
    div(rhoCpPhi,T)     Gauss upwind;
    div(rhoPhi,K)       Gauss upwind;
    
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    "div\(phi,alpha.*\)"    Gauss vanLeer;
    "div\(phir,alpha.*\)"   Gauss linear;

    "div\(Yiphir,alpha.*\)" Gauss linear;
    "div\(phi,.*\.air.*\)"  Gauss vanLeer;
    
    div((interpolate(cp)*rhoPhi),T)     Gauss upwind;
    div((muEff*dev(T(grad(U)))))        Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

fluxRequired
{
    default         no;
    p_rgh             ;
    Xvapour.air;
    "alpha.*";
} 


// ************************************************************************* //
